const regex = {
    uid: /^[a-z]+[a-z0-9]{4,9}$/g,
    upw: /^(?=.*[A-Za-z])(?=.*\d)(?=.*[@$!%*#?&])[A-Za-z\d@$!%*#?&]{8,15}$/,
    nm: /^([가-힣]{2,15})$/,
    birth: /^(19[0-9][0-9]|20\d{2})(0[0-9]|1[0-2])(0[1-9]|[1-2][0-9]|3[0-1])$/,
    ph: /^01(?:0|1|[6-9])(?:\d{3}|\d{4})\d{4}$/,
    email: /^([\w\.\_\-])*[a-zA-Z0-9]+([\w\.\_\-])*([a-zA-Z0-9])+([\w\.\_\-])+@([a-zA-Z0-9]+\.)+[a-zA-Z0-9]{2,8}$/,
    msg: {
        uidmag: '영소문자조합의 5-10자',
        upwmsg: '영소문자,대문자/숫자/특수문자 조합 8~15자리',
        nmmsg: '한글조합으로 2~5글자',
        birthmsg: '- 없이 8자리',
        phmsg: '- 없이 입력해주세요.',
        emailmsg: '이메일 양식에 맞추어 입력하세요.'
    },
    isWrongWith: function (target, val) {
        return (target && val) ? !this[target].test(val) : true;
    }
};
